{
	"ants-yelling": {
		"lines": 24,
		"title": "A colony of ants yelling as loud as they possibly can",
		"details": [],
		"date": [11, 3, 2025],
		"desc": "<p>Ants are tiny. If they yell, they’re still going to be tiny. It’ll be a sort of pathetic kind of yell.</p><p>Here, we’ve got a group of ants cented on the screen, with each represented by the word “AH.” Their screams are a simple animation that changes their font size, but even with their loudest voices they can still only reach 10px. Hey, at least they’re trying!</p>"
	},
	"dance-audition": {
		"lines": 47,
		"title": "You’re up on the world’s #1 hit amateur dance show",
		"details": [],
		"date": [11, 3, 2025],
		"desc": "<p>Dancing is all about knowing the right moves. (Or at least, that’s what I think because I don’t know how to dance.) What’s the computer equivalent of a “move?” What about clicking a key on your keyboard!</p><p>To nail your audition, you’ll need to press the key on the screen. Every time you get the right key, a new one is picked at random, and a new random dance move is picked, too! There’s no time limit, but hitting the wrong key ends your audition.</p>"
	},
	"banana-dealer": {
		"lines": 72,
		"title": "Desperate for bananas, low on cash, stuck in a volatile economy",
		"details": [],
		"date": [11, 3, 2025],
		"desc": "<p>Bananas are getting expensive these days. Who knows how much a banana will cost tomorrow? Even worse, who knows how much a banana will cost in the next minute or second?</p><p>Play this game and try to buy as many bananas as you can without going broke! Start with $20 and try to buy bananas as the lowest price possible. The game ends when you try to buy a banana but don’t have enough money to afford it!</p>"
	},
	"accidental-explosions": {
		"lines": 40,
		"title": "Someone keeps launching missiles by accident, and that person might be you",
		"details": [],
		"date": [11, 3, 2025],
		"desc": "<p>What does a missile look like? I don’t really know, but I figure that it creates an explosion, which when seen from above looks like a pulsing red circle.</p><p>In this story, I use JavaScript to track when the user moves their mouse. I then create an element at that exact location. Using CSS, I position that element at that exact location and have it run an animation to get bigger and smaller repeatedly. The result: missiles!</p>"
	},
	"panic-button": {
		"lines": 48,
		"title": "A panic button designed to relieve panic",
		"details": [],
		"date": [11, 3, 2025],
		"desc": "<p>Feeling anxious? Like you’re ready to burst? Then this panic button is for you! Clicking this button is a surefire way to release a tiny bit of dopamine even in the scariest of times. (Unless you’re allergic to cats...)</p>"
	},
	"gentle-giant": {
		"lines": 11,
		"title": "A gentle giant asking for directions to the local bowling alley",
		"details": [],
		"date": [11, 3, 2025],
		"desc": "<p>A giant’s got to have a loud voice. That’s kind of scary. But how can they make themselves seem a little friendlier? What if all they’re asking is for directions to their favorite place?</p><p>In this story, the giant is represented by appropriately gigantic text. But to counteract this giganticness, the text is light and soft.</p>"
	}
}